app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.includes(:user).order("id DESC").page(params[:page]).per(5)
---
SELECT  `tweets`.* FROM `tweets` ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)

  def create
    Tweet.create(create_tweet_params)
---
INSERT INTO `tweets` (`text`, `created_at`, `updated_at`, `user_id`) VALUES ('cccccccccccc', '2019-01-03 04:20:43', '2019-01-03 04:20:43', 2)

  def show
    @tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1

  def edit
    @tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1

  def update
    tweet = Tweet.find(params[:id])
    tweet.update(edit_tweet_params) if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1
UPDATE `tweets` SET `text` = 'aaaaaaaaaaaaaaaaaaaaaa更新', `updated_at` = '2019-01-03 03:31:19' WHERE `tweets`.`id` = 19

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 3 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 3